---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.OrientToView
source: html/cf3aa697-26ed-422d-85f2-ec46f7abd5cf.htm
---
# Autodesk.Revit.DB.BaseImportOptions.OrientToView Property

Place the import at the same orientation as the view that was passed into the import method.
 This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)

## Syntax (C#)
```csharp
public bool OrientToView { get; set; }
```